<template>
  <div>
    <div id="app">
      <div class="container">
        <deviceChoose :data="infData" :selectId.sync="selectId">
          <template v-slot:desc="slotProps">
            <div class="control-content-header">{{ slotProps.item.name }}</div>
          </template>
        </deviceChoose>
      </div>
    </div>
  </div>
</template>

<script>
import deviceChoose from "./components/DeviceChoose.vue";

export default {
  name: "App",
  components: {
    // ControlCard,
    deviceChoose,
  },
  data() {
    return { infData: [], selectId: -1 };
  },
  created() {
    this.infData = [
      {
        id: "1",
        name: "DH7512",
        recommend: 1,
        desc: "强劲性能，无惧考验",
        img: "@/assets/card.png",
        detail:
          "色彩管理  3D功能 将显示色域在不同色域间自由实时地切换，使显 配合支持 3D 功能的发送卡，输出 3D 画面。  RGB 独立 Gamma 调节 示屏的色彩呈现更精准。 配合支持 RGB 独立 Gamma 调节的独立主控和 18bit+ 4 倍提升显示灰阶，有效处理低亮时灰度丢失问 NovaLCT(V5.2.0 及以上版本)，通过对“红 题，使图像显示更细腻。 Gamma”、“绿 Gamma”、“蓝 Gamma”分别进行 调节，有效控制显示屏低灰不均匀、白平衡漂移 逐点亮色度校正 等问题，使画面更加真实。 配合诺瓦高精度校正系统，对每个灯点的亮度和 色度进行校正，有效消除亮度差异和色度差异，  画面90°倍数旋转 使整屏的亮色度达到高度一致。 画面以 90°的倍数(0°/90°/180°/270°)进行 旋转。 快速亮暗线调节 调节模组拼接和箱体拼接造成的亮暗线，改善亮 暗线引起的视觉突兀感。调节过程中即时生效， 简单易用。预存画面设置 NovaLCT 需是 V5.2.0 及以上版本。  固件程序回读 自定义开机、网线断开、无视频源信号时显示屏 回读接收卡的固件程序并保存到本地。 的画面。画面90°倍数旋转 使整屏的亮色度达到高度... ",
      },
      {
        id: "2",
        name: "DH3208",
        recommend: 0,
        desc: "强劲性能，无惧考验",
        img: "@/assets/card.png",
        detail:
          "色彩管理  3D功能 将显示色域在不同色域间自由实时地切换，使显 配合支持 3D 功能的发送卡，输出 3D 画面。  RGB 独立 Gamma 调节 示屏的色彩呈现更精准。 配合支持 RGB 独立 Gamma 调节的独立主控和 18bit+ 4 倍提升显示灰阶，有效处理低亮时灰度丢失问 NovaLCT(V5.2.0 及以上版本)，通过对“红 题，使图像显示更细腻。 Gamma”、“绿 Gamma”、“蓝 Gamma”分别进行 调节，有效控制显示屏低灰不均匀、白平衡漂移 逐点亮色度校正 等问题，使画面更加真实。 配合诺瓦高精度校正系统，对每个灯点的亮度和 色度进行校正，有效消除亮度差异和色度差异，  画面90°倍数旋转 使整屏的亮色度达到高度一致。 画面以 90°的倍数(0°/90°/180°/270°)进行 旋转。 快速亮暗线调节 调节模组拼接和箱体拼接造成的亮暗线，改善亮 暗线引起的视觉突兀感。调节过程中即时生效， 简单易用。预存画面设置 NovaLCT 需是 V5.2.0 及以上版本。  固件程序回读 自定义开机、网线断开、无视频源信号时显示屏 回读接收卡的固件程序并保存到本地。 的画面。画面90°倍数旋转 使整屏的亮色度达到高度... ",
      },
      {
        id: "3",
        name: "DH7508",
        recommend: 0,
        desc: "强劲性能，无惧考验",
        img: "@/assets/card.png",
        detail:
          "色彩管理  3D功能 将显示色域在不同色域间自由实时地切换，使显 配合支持 3D 功能的发送卡，输出 3D 画面。  RGB 独立 Gamma 调节 示屏的色彩呈现更精准。 配合支持 RGB 独立 Gamma 调节的独立主控和 18bit+ 4 倍提升显示灰阶，有效处理低亮时灰度丢失问 NovaLCT(V5.2.0 及以上版本)，通过对“红 题，使图像显示更细腻。 Gamma”、“绿 Gamma”、“蓝 Gamma”分别进行 调节，有效控制显示屏低灰不均匀、白平衡漂移 逐点亮色度校正 等问题，使画面更加真实。 配合诺瓦高精度校正系统，对每个灯点的亮度和 色度进行校正，有效消除亮度差异和色度差异，  画面90°倍数旋转 使整屏的亮色度达到高度一致。 画面以 90°的倍数(0°/90°/180°/270°)进行 旋转。 快速亮暗线调节 调节模组拼接和箱体拼接造成的亮暗线，改善亮 暗线引起的视觉突兀感。调节过程中即时生效， 简单易用。预存画面设置 NovaLCT 需是 V5.2.0 及以上版本。  固件程序回读 自定义开机、网线断开、无视频源信号时显示屏 回读接收卡的固件程序并保存到本地。 的画面。画面90°倍数旋转 使整屏的亮色度达到高度... ",
      },
      {
        id: "4",
        name: "DH426/HDH756",
        recommend: 0,
        desc: "强劲性能，无惧考验",
        img: "@/assets/card.png",
        detail:
          "色彩管理  3D功能 将显示色域在不同色域间自由实时地切换，使显 配合支持 3D 功能的发送卡，输出 3D 画面。  RGB 独立 Gamma 调节 示屏的色彩呈现更精准。 配合支持 RGB 独立 Gamma 调节的独立主控和 18bit+ 4 倍提升显示灰阶，有效处理低亮时灰度丢失问 NovaLCT(V5.2.0 及以上版本)，通过对“红 题，使图像显示更细腻。 Gamma”、“绿 Gamma”、“蓝 Gamma”分别进行 调节，有效控制显示屏低灰不均匀、白平衡漂移 逐点亮色度校正 等问题，使画面更加真实。 配合诺瓦高精度校正系统，对每个灯点的亮度和 色度进行校正，有效消除亮度差异和色度差异，  画面90°倍数旋转 使整屏的亮色度达到高度一致。 画面以 90°的倍数(0°/90°/180°/270°)进行 旋转。 快速亮暗线调节 调节模组拼接和箱体拼接造成的亮暗线，改善亮 暗线引起的视觉突兀感。调节过程中即时生效， 简单易用。预存画面设置 NovaLCT 需是 V5.2.0 及以上版本。  固件程序回读 自定义开机、网线断开、无视频源信号时显示屏 回读接收卡的固件程序并保存到本地。 的画面。画面90°倍数旋转 使整屏的亮色度达到高度... ",
      },
      {
        id: "5",
        name: "MRV328",
        recommend: 0,
        desc: "匠心打造，为效率而生",
        img: "@/assets/card.png",
        detail:
          "色彩管理  3D功能 将显示色域在不同色域间自由实时地切换，使显 配合支持 3D 功能的发送卡，输出 3D 画面。  RGB 独立 Gamma 调节 示屏的色彩呈现更精准。 配合支持 RGB 独立 Gamma 调节的独立主控和 18bit+ 4 倍提升显示灰阶，有效处理低亮时灰度丢失问 NovaLCT(V5.2.0 及以上版本)，通过对“红 题，使图像显示更细腻。 Gamma”、“绿 Gamma”、“蓝 Gamma”分别进行 调节，有效控制显示屏低灰不均匀、白平衡漂移 逐点亮色度校正 等问题，使画面更加真实。 配合诺瓦高精度校正系统，对每个灯点的亮度和 色度进行校正，有效消除亮度差异和色度差异，  画面90°倍数旋转 使整屏的亮色度达到高度一致。 画面以 90°的倍数(0°/90°/180°/270°)进行 旋转。 快速亮暗线调节 调节模组拼接和箱体拼接造成的亮暗线，改善亮 暗线引起的视觉突兀感。调节过程中即时生效， 简单易用。预存画面设置 NovaLCT 需是 V5.2.0 及以上版本。  固件程序回读 自定义开机、网线断开、无视频源信号时显示屏 回读接收卡的固件程序并保存到本地。 的画面。画面90°倍数旋转 使整屏的亮色度达到高度... ",
      },
      {
        id: "6",
        name: "DH75122",
        recommend: 0,
        desc: "强劲性能，无惧考验",
        img: "@/assets/card.png",
        detail:
          "色彩管理  3D功能 将显示色域在不同色域间自由实时地切换，使显 配合支持 3D 功能的发送卡，输出 3D 画面。  RGB 独立 Gamma 调节 示屏的色彩呈现更精准。 配合支持 RGB 独立 Gamma 调节的独立主控和 18bit+ 4 倍提升显示灰阶，有效处理低亮时灰度丢失问 NovaLCT(V5.2.0 及以上版本)，通过对“红 题，使图像显示更细腻。 Gamma”、“绿 Gamma”、“蓝 Gamma”分别进行 调节，有效控制显示屏低灰不均匀、白平衡漂移 逐点亮色度校正 等问题，使画面更加真实。 配合诺瓦高精度校正系统，对每个灯点的亮度和 色度进行校正，有效消除亮度差异和色度差异，  画面90°倍数旋转 使整屏的亮色度达到高度一致。 画面以 90°的倍数(0°/90°/180°/270°)进行 旋转。 快速亮暗线调节 调节模组拼接和箱体拼接造成的亮暗线，改善亮 暗线引起的视觉突兀感。调节过程中即时生效， 简单易用。预存画面设置 NovaLCT 需是 V5.2.0 及以上版本。  固件程序回读 自定义开机、网线断开、无视频源信号时显示屏 回读接收卡的固件程序并保存到本地。 的画面。画面90°倍数旋转 使整屏的亮色度达到高度... ",
      },
      {
        id: "7",
        name: "DH75123",
        recommend: 0,
        desc: "强劲性能，无惧考验",
        img: "@/assets/card.png",
        detail:
          "色彩管理  3D功能 将显示色域在不同色域间自由实时地切换，使显 配合支持 3D 功能的发送卡，输出 3D 画面。  RGB 独立 Gamma 调节 示屏的色彩呈现更精准。 配合支持 RGB 独立 Gamma 调节的独立主控和 18bit+ 4 倍提升显示灰阶，有效处理低亮时灰度丢失问 NovaLCT(V5.2.0 及以上版本)，通过对“红 题，使图像显示更细腻。 Gamma”、“绿 Gamma”、“蓝 Gamma”分别进行 调节，有效控制显示屏低灰不均匀、白平衡漂移 逐点亮色度校正 等问题，使画面更加真实。 配合诺瓦高精度校正系统，对每个灯点的亮度和 色度进行校正，有效消除亮度差异和色度差异，  画面90°倍数旋转 使整屏的亮色度达到高度一致。 画面以 90°的倍数(0°/90°/180°/270°)进行 旋转。 快速亮暗线调节 调节模组拼接和箱体拼接造成的亮暗线，改善亮 暗线引起的视觉突兀感。调节过程中即时生效， 简单易用。预存画面设置 NovaLCT 需是 V5.2.0 及以上版本。  固件程序回读 自定义开机、网线断开、无视频源信号时显示屏 回读接收卡的固件程序并保存到本地。 的画面。画面90°倍数旋转 使整屏的亮色度达到高度... ",
      },
      {
        id: "8",
        name: "DH75124",
        recommend: 0,
        desc: "强劲性能，无惧考验",
        img: "@/assets/card.png",
        detail:
          "色彩管理  3D功能 将显示色域在不同色域间自由实时地切换，使显 配合支持 3D 功能的发送卡，输出 3D 画面。  RGB 独立 Gamma 调节 示屏的色彩呈现更精准。 配合支持 RGB 独立 Gamma 调节的独立主控和 18bit+ 4 倍提升显示灰阶，有效处理低亮时灰度丢失问 NovaLCT(V5.2.0 及以上版本)，通过对“红 题，使图像显示更细腻。 Gamma”、“绿 Gamma”、“蓝 Gamma”分别进行 调节，有效控制显示屏低灰不均匀、白平衡漂移 逐点亮色度校正 等问题，使画面更加真实。 配合诺瓦高精度校正系统，对每个灯点的亮度和 色度进行校正，有效消除亮度差异和色度差异，  画面90°倍数旋转 使整屏的亮色度达到高度一致。 画面以 90°的倍数(0°/90°/180°/270°)进行 旋转。 快速亮暗线调节 调节模组拼接和箱体拼接造成的亮暗线，改善亮 暗线引起的视觉突兀感。调节过程中即时生效， 简单易用。预存画面设置 NovaLCT 需是 V5.2.0 及以上版本。  固件程序回读 自定义开机、网线断开、无视频源信号时显示屏 回读接收卡的固件程序并保存到本地。 的画面。画面90°倍数旋转 使整屏的亮色度达到高度... ",
      },
      {
        id: "9",
        name: "DH75125",
        recommend: 0,
        desc: "强劲性能，无惧考验",
        img: "src/assets/card.png",
        detail:
          "色彩管理  3D功能 将显示色域在不同色域间自由实时地切换，使显 配合支持 3D 功能的发送卡，输出 3D 画面。  RGB 独立 Gamma 调节 示屏的色彩呈现更精准。 配合支持 RGB 独立 Gamma 调节的独立主控和 18bit+ 4 倍提升显示灰阶，有效处理低亮时灰度丢失问 NovaLCT(V5.2.0 及以上版本)，通过对“红 题，使图像显示更细腻。 Gamma”、“绿 Gamma”、“蓝 Gamma”分别进行 调节，有效控制显示屏低灰不均匀、白平衡漂移 逐点亮色度校正 等问题，使画面更加真实。 配合诺瓦高精度校正系统，对每个灯点的亮度和 色度进行校正，有效消除亮度差异和色度差异，  画面90°倍数旋转 使整屏的亮色度达到高度一致。 画面以 90°的倍数(0°/90°/180°/270°)进行 旋转。 快速亮暗线调节 调节模组拼接和箱体拼接造成的亮暗线，改善亮 暗线引起的视觉突兀感。调节过程中即时生效， 简单易用。预存画面设置 NovaLCT 需是 V5.2.0 及以上版本。  固件程序回读 自定义开机、网线断开、无视频源信号时显示屏 回读接收卡的固件程序并保存到本地。 的画面。画面90°倍数旋转 使整屏的亮色度达到高度... ",
      },
      {
        id: "10",
        name: "DH75125",
        recommend: 0,
        desc: "强劲性能，无惧考验",
        img: "@/assets/card.png",
        detail:
          "色彩管理  3D功能 将显示色域在不同色域间自由实时地切换，使显 配合支持 3D 功能的发送卡，输出 3D 画面。  RGB 独立 Gamma 调节 示屏的色彩呈现更精准。 配合支持 RGB 独立 Gamma 调节的独立主控和 18bit+ 4 倍提升显示灰阶，有效处理低亮时灰度丢失问 NovaLCT(V5.2.0 及以上版本)，通过对“红 题，使图像显示更细腻。 Gamma”、“绿 Gamma”、“蓝 Gamma”分别进行 调节，有效控制显示屏低灰不均匀、白平衡漂移 逐点亮色度校正 等问题，使画面更加真实。 配合诺瓦高精度校正系统，对每个灯点的亮度和 色度进行校正，有效消除亮度差异和色度差异，  画面90°倍数旋转 使整屏的亮色度达到高度一致。 画面以 90°的倍数(0°/90°/180°/270°)进行 旋转。 快速亮暗线调节 调节模组拼接和箱体拼接造成的亮暗线，改善亮 暗线引起的视觉突兀感。调节过程中即时生效， 简单易用。预存画面设置 NovaLCT 需是 V5.2.0 及以上版本。  固件程序回读 自定义开机、网线断开、无视频源信号时显示屏 回读接收卡的固件程序并保存到本地。 的画面。画面90°倍数旋转 使整屏的亮色度达到高度... ",
      },
    ];
  },
  watch: {},
  methods: {},
};
</script>

<style lang="less" scoped>
#app {
  font-family: Avenir, Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
  padding-top: 60px;
  display: flex;
  justify-content: center;
  .container {
    width: 1180px;
    height: 252px;
    background: #f0f0f4;
  }
}
</style>
